<div class="alert alert-block alert-success">
    <h1 align="center">Machine Learning in Python</h1>
    <h3 align="center"> Pandas</h3>

</div>

<img src="https://miro.medium.com/max/601/1*cxfqR8NAj8HGal8CVOZ7hg.png">

<div class="alert alert-block alert-success">
<p dir="rtl" style="text-align: center;"><span style="font-family: comic sans ms, sans-serif; font-size: 18pt;">آموزش کتابخانه Pandas با بررسی دیتاست Titanic</span></p>

</div>

In [ ]:
import pandas as pd

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">pd.read_csv()</span></strong>
<p dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier;"><span style="font-size: 18pt;">نحوه خواندن فایل با فرمت csv توسط pandas</span><br /></span></strong></p>
</div>

In [ ]:
titanic_data = pd.read_csv(r"C:\Users\soso\Desktop\data.csv")
#RAW
titanic_data = pd.read_csv("titanic.csv")

In [ ]:
titanic_data

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">head()</span></strong>
<p style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">نمایش ۵ داده اول ذخیره شده در دیتافریم</span></strong></p>
</div>
<p dir="rtl" style="text-align: right;"><strong><span style="font-family: courier new, courier;"><em>در صورت ثبت عدد به عنوان پارامتر ورودی، همان تعداد داده از index های ابتدایی دیتافریم را نمایش خواهد داد.</em></span></strong></p>

In [ ]:
type(titanic_data)

pandas.core.frame.DataFrame

In [ ]:
titanic_data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [ ]:
titanic_data.tail()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [ ]:
titanic_data.sample(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1105,3,0,"Panula, Mr. Jaako Arnold",male,14.0,4,1,3101295,39.6875,NaN,S,NaN,NaN,NaN
1057,3,1,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417,NaN,C,C,NaN,NaN

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">shape</span></strong>
<p style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">مشاهده ابعاد (سطر و ستون) دیتافریم<br /></span></strong></p>
</div>

In [ ]:
titanic_data.shape

(1309, 14)

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">Columns</span></strong>
<p style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">مشاهده عناوین ستون های دیتافریم<br /></span></strong></p>
</div>

In [ ]:
titanic_data.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">dtypes</span></strong>
<p style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">مشاهده عناوین ستون ها و تایپ داده هایشان<br /></span></strong></p>
</div>

In [ ]:
titanic_data.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">info()</span></strong>
<p style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">اطلاعات کاملتر در مورد داده ها<br /></span></strong></p>
<p dir="rtl" style="text-align: right;"><strong><span style="font-family: courier new, courier;"><em><span style="font-size: 12pt;">تعداد کل داده ها</span></em></span></strong></p>
<p dir="rtl" style="text-align: right;"><strong><span style="font-family: courier new, courier;"><em><span style="font-size: 12pt;">تمامی ستون ها به همراه تایپ داده هایشان</span></em></span></strong></p>
<p dir="rtl" style="text-align: right;"><strong><span style="font-family: courier new, courier;"><em><span style="font-size: 12pt;">هر ستون چه تعداد داده not-null دارد</span></em></span></strong></p>
</div>

In [ ]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [ ]:
titanic_data.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881138,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413493,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.170000,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><span style="font-family: courier new, courier;"><span style="font-size: 18pt;"><strong>انتخاب سطر و ستون های خاص</strong></span><span style="font-size: 18pt;"><br /></span></span></div>

In [ ]:
titanic_data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [ ]:
titanic_data['survived'][10:15]

10    0
11    1
12    1
13    1
14    1
Name: survived, dtype: int64

In [ ]:
titanic_data.survived[0:5]

0    1
1    1
2    0
3    0
4    0
Name: survived, dtype: int64

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier;"><span style="font-size: 18pt;">انتخاب ستون ها بر اساس چند عنوان مورد نظر</span><span style="font-size: 18pt;"><br /></span></span></strong></div>

In [ ]:
titanic_data[['survived','age','fare']][10:25]

    survived   age      fare
10         0  47.0  227.5250
11         1  18.0  227.5250
12         1  24.0   69.3000
13         1  26.0   78.8500
14         1  80.0   30.0000
15         0   NaN   25.9250
16         0  24.0  247.5208
17         1  50.0  247.5208
18         1  32.0   76.2917
19         0  36.0   75.2417
20         1  37.0   52.5542
21         1  47.0   52.5542
22         1  26.0   30.0000
23         1  42.0  227.5250
24         1  29.0  221.7792

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em>value_counts</em>()</span></strong>
<p dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">پرینت داده های Unique در کل ستون<br /></span></strong></p>
</div>

In [ ]:
titanic_data['survived'].value_counts()

0    809
1    500
Name: survived, dtype: int64

In [ ]:
titanic_data['survived'].value_counts(normalize=True)* 100

0    61.802903
1    38.197097
Name: survived, dtype: float64

<div class="alert alert-block alert-success" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em>از بین بازماندگان ۳۳۹ نفر <span style="text-decoration: underline;">زن</span> و تنها ۱۶۱ نفر <span style="text-decoration: underline;">مرد</span> بوده اند.<br /></em></span></strong></div>

In [ ]:
pd.crosstab( titanic_data.sex, titanic_data.survived )

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em>نرمالایز نمودن داده ها بر اساس سطر<br /></em></span></strong></div>

In [ ]:
pd.crosstab( titanic_data.sex, titanic_data.survived, normalize = "index" )

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><span style="font-family: comic sans ms, sans-serif; font-size: 18pt;"><strong><em><span style="font-family: courier new, courier;">نرمالایز نمودن داده ها بر اساس ستون</span></em><em><br /></em></strong></span></div>

In [ ]:
pd.crosstab( titanic_data.sex, titanic_data.survived, normalize = "columns" )

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em>نرمالایز نمودن کل داده ها<br /></em></span></strong></div>

In [ ]:
pd.crosstab( titanic_data.sex, titanic_data.survived, normalize = "all" )

<div class="alert alert-block alert-info" dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em> لیست کودکان زیر ۵ سال برای ارایه به خانواده بازماندگان</em></span></strong></div>

In [ ]:
below_5_years = titanic_data[ titanic_data.age <= 5 ]

In [ ]:
below_5_years[0:3]

<div class="alert alert-block alert-success" dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em>چه تعداد از مسافران کودک زیر ۵ سال بودند؟</em></span></strong></div>

In [ ]:
len( below_5_years )

<div class="alert alert-block alert-success" dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em>&nbsp;۳۷ کودک از بین ۵۶ کودک زنده ماندند.<br /></em></span></strong></div>

In [ ]:
titanic_data[ titanic_data.age <= 5 ][["survived","age","pclass"]]

In [ ]:
titanic_data[ titanic_data.age <= 5 ]["survived"].value_counts( )

<div class="alert alert-block alert-success" dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em>نزدیک به ۲/۳ از کل کودکان زنده ماندند</em></span></strong></div>

In [ ]:
titanic_data[ titanic_data.age <= 5 ]["survived"].value_counts( normalize = True )

<div class="alert alert-block alert-info" dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em>از بین مسافرین، افراد با نام Allen را میخواهیم.</em></span></strong></div>

In [ ]:
titanic_data[titanic_data.name.str.contains( "Allen") ]

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">unique()</span></strong>
<p style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">داده های منحصر به فرد در هر ستون<br /></span></strong></p>
</div>

In [ ]:
titanic_data.embarked.unique()

<div class="alert alert-block alert-success" dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 14pt;">پرینت اطلاعات مربوط به جنسیت و سن و Pclass افرادی که زنده ماندند.<br /></span></strong></div>

In [ ]:
titanic_data[ ( titanic_data.survived == 1 ) &
           ( titanic_data.age <= 5 ) ][['age','sex','pclass']][10:20]

<div class="alert alert-block alert-success" dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 14pt;">پرینت اطلاعات مربوط به جنسیت و Pclass افرادی که زنده ماندند و سن آن ها مشخص نبوده است.<br /></span></strong></div>

In [ ]:
titanic_data[ titanic_data.age.isnull() ][['age',
                                         'survived',
                                         'sex',
                                         'pclass']][0:5]

<div class="alert alert-block alert-success" dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 14pt;">پرینت اطلاعات مربوط به جنسیت و Pclass افرادی که زنده ماندند و سن آن ها مشخص  است.<br /></span></strong></div>

In [ ]:
titanic_data[ -titanic_data.age.isnull() ][['age',
                                          'survived',
                                          'sex',
                                          'pclass']][0:5]

<div class="alert alert-block alert-info" dir="rtl" style="text-align: center;"><strong><span style="font-size: 18pt; font-family: courier new, courier;">نحوه ادغام و گروه بندی ستون های مختلف<br /></span></strong></div>

In [ ]:
titanic_data.groupby( 'pclass' )['fare'].mean()

In [ ]:
pclass_age_mean_df = titanic_data.groupby( 'pclass' )['age'].mean().reset_index()
pclass_age_mean_df

In [ ]:
pclass_gender_age_mean_df = titanic_data.groupby( ['pclass', 'sex'] )['fare'].mean().reset_index()
pclass_gender_age_mean_df

<div class="alert alert-block alert-info" dir="rtl" style="text-align: center;"><strong><span style="font-size: 18pt; font-family: courier new, courier;">نحوه مربت سازی داده های دیتافریم<br /></span></strong></div>

In [ ]:
titanic_data.sort_values( 'age',ascending=False)

In [ ]:
titanic_data.sort_values( 'survived', ascending = False)